Revit 2027 API
Application.SetSystemsAnalysisWorkflows Method
 Sets name and path information identifying systems analysis workflow files.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSystemsAnalysisWorkflows(
	IDictionary<string, string> paths
)
Public Sub SetSystemsAnalysisWorkflows (
	paths As IDictionary(Of String, String)
)
public:
void SetSystemsAnalysisWorkflows(
	IDictionary<String^, String^>^ paths
)
member SetSystemsAnalysisWorkflows :
        paths : IDictionary<string, string> -> unit
Parameters
paths IDictionary<String, String>
 The map of systems analysis workflows.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The map should be specified as a key that is the name of the systems analysis workflow, and a value that is the path to the workflow file.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace